--транспозер сканирует сундук на наличие свитков 
--(надо сделать так, чтоб он различал изученные и неизученные)
--если в слоте есть свиток, кидает его в выбрасыватель ботании (в сундук к выбрасывателю)
--свиток попадает на книгу, там пока работает печка и качает когнитио 
--(надо сделать простой способ фарма бумаги)
--после перемещения, с задержкой в секунду, адаптер начинает сканировать книгу
--в цикле, раз в 5 секунд, смотрим, сколько осталось каждого аспекта (не важны их названия)
--если все 3 по нулям, отдается команда роботу grab

--робот забирает свиток и передает его в итоговыйй сундук
--потом цикл продолжается на следующие слоты

